/*
 팩토리얼 0의 개수
 */
#include <iostream>

using namespace std;

int main(void){
    int n, N;
    cin >> N;
    
    int five = 0; // 5의 개수
    
    while(N){
        n = N;
        while(n%5 == 0){
            if(n%5 == 0){
                five++;
                n /= 5;
            }
        }
        N--;
    }
    cout << five;
    return 0;
}

/*
 팩토리얼을 구한 후 계산하면 시간초과
 팩토리얼을 구하지 않고, 팩토리얼 결과값을 구성하는 각 요소들을 2와 5로 분해하여 각각의 개수를 센다.
 
 즉,
 0의 개수는 10의 개수와 동일
 10 = 2*5
 2의 5가 몇쌍인지 확인
 
 팩토리얼에서 2의 개수는 5의 개수보다 항상 많으므로, 5의 개수만 확인
 */

/*
 팩토리얼을 구한 후 계산하면 시간초과
 팩토리얼을 구하지 않고, 팩토리얼 결과값을 구성하는 각 요소들을 2와 5로 분해하여 각각의 개수를 센다.
 
 즉,
 0의 개수는 10의 개수와 동일
 10 = 2*5
 2의 5가 몇쌍인지 확인
 
 팩토리얼에서 2의 개수는 5의 개수보다 항상 많으므로, 5의 개수만 확인
 */
